src/cf/DataProcessors/ПомощникУплатыНалоговВзносовПрошлыхЛет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПомощникУплатыНалоговВзносовПрошлыхЛет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыИнтеграцииСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыИнтеграцииСБанком</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовИнтеграцииСБанком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыОперацийПереходаНаЕНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыОперацийПереходаНаЕНС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПерехода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБанковскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СпособыУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыУплатыНалогов</Name>
			<Comment>Способы уплаты налогов и взносов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БанковскийПеревод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаличнымиПоКвитанции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыСвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыБезСпецоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосрегистрацияОрганизацийЧерезМФЦ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Госпошлина_ГосрегистрацияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ВредныеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_Шахтеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ВнутригородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МежселеннаяТерритория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_СельскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МуниципальныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмуществоЕСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_РегиональныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_ФедеральныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС_ВвозимыеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ДоходыСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП_НалоговаяБазаСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеНалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ВнутригородскойРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС_НСиПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_МинимальныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалоговыйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыЕдиныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_СвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОПС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОМС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОСС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоЕдиномуНалоговомуСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоЕдиномуНалоговомуСчету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПенейШтрафов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПенейШтрафов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ПомощникУплатыНалоговВзносовПрошлыхЛет/Forms/ФормаОплатыЗаПрошлыеПериоды/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = Параметры.Организация;
	Объект.Период      = ПомощникиПоУплатеНалоговИВзносов.ГраницаОтчетностиПрошлыхПериодов(Объект.Организация);
	
	Правило = Параметры.Правило;
	КодЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Правило, "Владелец.Код");
	УстановитьЗаголовок();
	
	// Проверка заполненности реквизитов организации, необходимых для уплаты.
	ТекстДействия = НСтр("ru = 'оплатить задолженность за прошлые годы'");
	СообщениеТребуютсяРеквизиты = 
		ПроверкаРеквизитовОрганизации.СтрокаСообщенияНеЗаполненыРеквизитыДляОтчетности(Объект.Организация, ТекстДействия);
	РеквизитыОрганизацииЗаполнены = ПроверитьРеквизитыОрганизации(Объект.Организация).РеквизитыЗаполнены;
	
	ПоказыватьКомандыОплаты = ПомощникиПоУплатеНалоговИВзносов.ПоказыватьКомандыОплаты();
	ИнтерфейсИнтеграцииСБанками = ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком();
	
	ПерешлиНаЕдиныйТариф = Объект.Период >= УчетЗарплаты.ДатаПереходаНаЕдиныйТарифСтраховыхВзносов();
	
	ДатаПереходаНаЕНС = КонецДня(Объект.Период) + 1;
	ПлательщикЕНП = УчетнаяПолитика.ПлательщикЕНП(Объект.Организация, ДатаПереходаНаЕНС);
	
	ЗаполнитьЗадолженность();
	
	ЗаполнитьОперацииПоЕНС();
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	ЦветПодсветки = ЦветаСтиля.ВыборСтандартногоПериодаФонКнопки;
	
	УстановитьВидимостьКнопокОплаты();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗапуститьОбновлениеБаннераСостоянияОтправки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеВыписки"
		Или ИмяСобытия = "ОбновитьСостояниеОбменСБанками" Тогда
		
		ОбработкаОповещенияИзменениеВыписки();
		ЗапуститьОбновлениеБаннераСостоянияОтправки();
		
	ИначеЕсли ИмяСобытия = "Запись_ПлатежныйДокумент_УплатаНалогов" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("Организация")
			И Параметр.Организация = Объект.Организация Тогда
			
			НайтиИОтобразитьСвязанныеПлатежи();
			УстановитьВидимостьКнопокОплаты();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_Организации"
		И Объект.Организация = Источник Тогда
		
		РеквизитыОрганизацииЗаполнены = ПроверитьРеквизитыОрганизации(Объект.Организация).РеквизитыЗаполнены;
		УправлениеФормой(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "УдалитьДокументУплаты" Тогда
		
		УдалитьДокументУплаты(Параметр);
		ЗапуститьОбновлениеБаннераСостоянияОтправки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РезультатПроверкиРеквизитовОрганизации = ПроверитьРеквизитыОрганизации(Объект.Организация);
	Если НЕ РезультатПроверкиРеквизитовОрганизации.РеквизитыЗаполнены Тогда
		ТекстОписанияОбъектаПроверки = НСтр("ru = 'оплаты задолженности за прошлые годы'");
		ПроверкаРеквизитовОрганизации.СообщитьОбОшибкеЗаполненияРеквизитовДляОтчетности(
			Объект.Организация,
			РезультатПроверкиРеквизитовОрганизации.НезаполненныеРеквизиты,
			"СообщениеТребуютсяРеквизиты",
			Отказ,
			ТекстОписанияОбъектаПроверки)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СообщениеТребуютсяРеквизитыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",                 Объект.Организация);
	ПараметрыФормы.Вставить("Назначение",           "ДляОтчетности");
	ПараметрыФормы.Вставить("ПроверяемыеРеквизиты", ПроверяемыеРеквизитыОрганизации(Объект.Организация));
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлатежОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПлатежныхДокументов = ПомощникиПоУплатеНалоговИВзносовКлиент.ПараметрыОбработкиПлатежныхДокументов(
		Платежи, "Платеж", ОповещениеУдаленияПлатежногоДокумента());
	
	ПомощникиПоУплатеНалоговИВзносовКлиент.ОбработкаНавигационнойСсылкиПлатежногоДокумента(
		Элемент, НавигационнаяСсылкаФорматированнойСтроки, ПараметрыПлатежныхДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПрошлыхПериодовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Правило",     Правило);
	Оповещение = Новый ОписаниеОповещения("ОпросПомощникаЗавершение", ЭтотОбъект);
	Если КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиУСН()
		Или КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиНДФЛПредприниматель() Тогда
		
		ИмяФормыОпросника = "Обработка.МониторНалоговИОтчетности.Форма.ФормаТестПоНалогуЗаПрошлыеПериоды";
		
	ИначеЕсли КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиСтраховыеВзносыИП() Тогда
		ИмяФормыОпросника = "Обработка.МониторНалоговИОтчетности.Форма.ФормаТестПоВзносамЗаПрошлыеПериоды";
		ПараметрыФормы.Вставить("АдресСведенийОбОрганизации", АдресСведенийОбОрганизации(Объект.Организация, УникальныйИдентификатор));
	КонецЕсли;
	ОткрытьФорму(ИмяФормыОпросника, ПараметрыФормы, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОперацияЕНСОбработкаНавигационнойСсылки(Элемент, ТекстСсылки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДокументов = ПомощникиПоУплатеНалоговИВзносовКлиент.ПараметрыОбработкиСпискаДокументов(
		ОперацииПоЕНС, "ОперацияЕНС", Новый ОписаниеОповещения);
	
	ПомощникиПоУплатеНалоговИВзносовКлиент.ОбработкаНавигационнойСсылкиДокумента(Элемент,
		ТекстСсылки, ПараметрыДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОплатитьСБанковскогоСчета(Команда)
	
	Оплатить(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.БанковскийПеревод"))
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаличнымиПоКвитанции(Команда)
	
	Оплатить(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.НаличнымиПоКвитанции"))
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСостояниеЗагрузкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ИнтеграцияСБанкамиФормыКлиент.ОбработкаНавигационнойСсылкиБаннера(
		ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПлатежиВБанк(Команда)
	
	ДокументыОплатыПоБанку = ПлатежныеДокументыДляОтправкиПоДиректБанку();
	
	Если ЗначениеЗаполнено(ДокументыОплатыПоБанку) Тогда
		ОбменСБанкамиКлиент.СформироватьПодписатьОтправитьЭД(ДокументыОплатыПоБанку);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПлатежи(Команда)
	
	ДокументыОплатыВФайл = ПлатежныеДокументыДляВыгрузкиВФайл();
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьПлатежныеДокументыЗавершение", ЭтотОбъект);
	ПомощникиПоУплатеНалоговИВзносовКлиент.ПроверитьИВыгрузитьПлатежныеДокументы(
		Объект.Организация, ДокументыОплатыВФайл, Оповещение, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаОплатаЗадолженности.Видимость =  Форма.ПоказыватьКомандыОплаты;
	
	Элементы.СообщениеТребуютсяРеквизиты.Видимость =
		(ЗначениеЗаполнено(Объект.Организация) И НЕ Форма.РеквизитыОрганизацииЗаполнены);
	
	Элементы.ГруппаОперацияЕНС.Видимость = Форма.ПлательщикЕНП
		И Не ЗадолженностьОплаченаПолностью(Форма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокОплаты()
	
	СпособОплаты = ВыполнениеЗадачБухгалтера.СпособУплатыНалогаВзноса(Объект.Организация);
	
	НадоВыбратьСпособОплаты = Не ЗначениеЗаполнено(СпособОплаты);
	
	ЗадолженностьОплаченаПолностью = ЗадолженностьОплаченаПолностью(ЭтотОбъект);
	
	ТребуетсяОтправитьДокументыОплатыПоБанку = ТребуетсяОтправитьДокументыОплатыПоДиректБанку();
	ТребуетсяВыгрузитьДокументыОплаты = Не ТребуетсяОтправитьДокументыОплатыПоБанку И ТребуетсяВыгрузитьДокументыОплаты();

	Элементы.ОтправитьПлатежиВБанк.Видимость = ТребуетсяОтправитьДокументыОплатыПоБанку И Не ИнтерфейсИнтеграцииСБанками;
	Элементы.ВыгрузитьПлатежи.Видимость = ТребуетсяВыгрузитьДокументыОплаты И Не ИнтерфейсИнтеграцииСБанками;
	
	Элементы.ОплатитьСБанковскогоСчета.Видимость = Не ЗадолженностьОплаченаПолностью
		И (НадоВыбратьСпособОплаты Или СпособОплаты = Перечисления.СпособыУплатыНалогов.БанковскийПеревод);
	
	Элементы.ОплатитьНаличнымиПоКвитанции.Видимость = Не ЗадолженностьОплаченаПолностью
		И (НадоВыбратьСпособОплаты Или СпособОплаты = Перечисления.СпособыУплатыНалогов.НаличнымиПоКвитанции);
	
	НеОтправленныеПлатежи = НеОтправленныеПлатежи(ЭтотОбъект);
	КнопкаПоУмолчаниюОтправитьВБанк = ЗначениеЗаполнено(НеОтправленныеПлатежи) И Не ИнтерфейсИнтеграцииСБанками;
	
	КнопкаПоУмолчаниюУплата = Не КнопкаПоУмолчаниюОтправитьВБанк И Не ЗадолженностьОплаченаПолностью;
	
	УстановитьВидПоУмолчаниюОформлением(ЭтотОбъект, Элементы.ОплатитьСБанковскогоСчета, КнопкаПоУмолчаниюУплата);
	УстановитьВидПоУмолчаниюОформлением(ЭтотОбъект, Элементы.ОтправитьПлатежиВБанк, КнопкаПоУмолчаниюОтправитьВБанк);
	УстановитьВидПоУмолчаниюОформлением(ЭтотОбъект, Элементы.ВыгрузитьПлатежи, КнопкаПоУмолчаниюОтправитьВБанк);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗадолженностьОплаченаПолностью(Форма)
	
	Возврат (ИтогоКОплате(Форма) - ОплаченоНалогаВсего(Форма)) <= 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИтогоКОплате(Форма)
	
	Если ЭтоЗадачаВзносовИП(Форма.КодЗадачи) Тогда
		ИтогоКОплате = Форма.ПФРИтого + Форма.ФФОМСИтого + Форма.ЕдиныйТарифИтого;
	Иначе
		ИтогоКОплате = Форма.Итого;
	КонецЕсли;
	
	Возврат ИтогоКОплате;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидПоУмолчаниюОформлением(Форма, Элемент, ЭтоКнопкаПоУмолчанию)
	
	Шрифт = Новый Шрифт(Элемент.Шрифт, , , ЭтоКнопкаПоУмолчанию);
	
	Элемент.Шрифт    = Шрифт;
	Элемент.ЦветФона = ?(ЭтоКнопкаПоУмолчанию, Форма.ЦветПодсветки, Новый Цвет);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

&НаСервереБезКонтекста
Функция БанковскийСчетОрганизации(Знач Организация)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОсновнойБанковскийСчет");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗадолженность()
	
	ЭтоЗадачаВзносовИП = ЭтоЗадачаВзносовИП(КодЗадачи);
	Элементы.ГруппаНалог.Видимость = Не ЭтоЗадачаВзносовИП;
	Элементы.ГруппаПФР.Видимость   = ЭтоЗадачаВзносовИП И Не ПерешлиНаЕдиныйТариф;
	Элементы.ГруппаФФОМС.Видимость = ЭтоЗадачаВзносовИП И Не ПерешлиНаЕдиныйТариф;
	Элементы.ГруппаСтраховыеВзносыЕдиныйТариф.Видимость = ЭтоЗадачаВзносовИП И ПерешлиНаЕдиныйТариф;
	
	ВидыНалогов = Обработки.ПомощникУплатыНалоговВзносовПрошлыхЛет.ВидыНалоговПоКодуЗадачи(Объект.Организация, КодЗадачи);
	НачальныеОстатки = Обработки.ПомощникУплатыНалоговВзносовПрошлыхЛет.НачальныеОстаткиПоНалогам(Объект.Организация, Объект.Период);
	ТаблицаОстатков.Очистить();
	Для Каждого ВидНалога Из ВидыНалогов Цикл
		НайденныеСтроки = НачальныеОстатки.НайтиСтроки(Новый Структура("ВидНалога", ВидНалога));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СтрокаОстатков = ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОстатков, НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Если ЭтоЗадачаВзносовИП Тогда
		ЗаполнитьРеквизитыСуммВзносов();
	Иначе
		ЗаполнитьРеквизитыСуммНалога();
	КонецЕсли;
	
	// Текст баннера опроса
	БаннерОпроса = Новый Массив;
	ГодЗаголовкаОпроса = Год(КонецГода(Объект.Период) + 1);
	Если Не Обработки.ПомощникУплатыНалоговВзносовПрошлыхЛет.ПройденОпросПоНалогу(Объект.Организация, КодЗадачи)
		И (Итого + ПФРИтого + ФФОМСИтого + ЕдиныйТарифИтого) = 0 Тогда
		
		Шаблон = СтрШаблон(НСтр("ru = 'Проверьте, нет ли задолженности на начало %1 года.'"),
			Формат(ГодЗаголовкаОпроса, "ЧГ=0"));
		БаннерОпроса.Добавить(Шаблон);
		БаннерОпроса.Добавить(" ");
		БаннерОпроса.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Проверить'"),,,, "ПройтиОпрос"));
	Иначе
		Шаблон = СтрШаблон(НСтр("ru = 'По вашим ответам определена задолженность на начало %1 года.'"),
			Формат(ГодЗаголовкаОпроса, "ЧГ=0"));
		БаннерОпроса.Добавить(Шаблон);
		БаннерОпроса.Добавить(" ");
		БаннерОпроса.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Проверить еще раз'"),,,, "ПройтиОпрос"));
	КонецЕсли;
	ПроверкаПрошлыхПериодов = Новый ФорматированнаяСтрока(БаннерОпроса);
	
КонецПроцедуры

#КонецОбласти

#Область ОтображениеДокументовУплаты

&НаСервере
Процедура ОбработкаОповещенияИзменениеВыписки()
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	УстановитьВидимостьКнопокОплаты();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура НайтиИОтобразитьСвязанныеПлатежи()
	
	Платежи.Очистить();
	
	ЗаполнитьТаблицуПлатежей();
	
	ВывестиПлатежиИБаннерСостоянияОтправкиНаФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПлатежей()
	
	ТаблицаПлатежей = Обработки.ПомощникУплатыНалоговВзносовПрошлыхЛет.ДокументыУплаты(
		Объект.Организация,
		Объект.Период,
		Обработки.ПомощникУплатыНалоговВзносовПрошлыхЛет.ВидыНалоговПоКодуЗадачи(Объект.Организация, КодЗадачи),
		ВидыПлатежей(ЭтоЗадачаВзносовИП(КодЗадачи)));
	
	Если ТаблицаПлатежей <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаПлатежей Цикл
			ЗаполнитьЗначенияСвойств(Платежи.Добавить(), СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПлатежиИБаннерСостоянияОтправкиНаФорму()
	
	СостоянияИнтеграцииДокументов = РегистрыСведений.ДокументыИнтеграцииСБанком.СостоянияИнтеграцииДокументов(
		ДокументыОплаты(ЭтотОбъект));

	ПлатежиДляОтображения = ПомощникиПоУплатеНалоговИВзносов.ПлатежиДляОтображения(
		ЭтотОбъект.Платежи, СостоянияИнтеграцииДокументов);
	ПомощникиПоУплатеНалоговИВзносов.ОтобразитьПлатежи(ЭтотОбъект, ЭтотОбъект.Платежи, "Платеж");
	
	ИнтеграцияСБанкамиФормы.ПолучитьДанныеИПоказатьБаннерСостоянияОтправки(ЭтотОбъект, СостоянияИнтеграцииДокументов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХэшДанныхБаннера(Знач ДокументыОплаты)
	
	Возврат ИнтеграцияСБанкамиФормы.ХэшДанныхБаннера(ДокументыОплаты);
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОбновлениеБаннераСостоянияОтправки()
	Если ИнтервалПроверкиСостоянияИнтеграцииСБанком > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновлениеБаннераСостояниеОтправки", ИнтервалПроверкиСостоянияИнтеграцииСБанком, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапуститьОбновлениеБаннераСостояниеОтправки() Экспорт
	
	Документы = Новый Массив;
	Для Каждого Платеж Из Платежи Цикл
		Документы.Добавить(Платеж.Ссылка);
	КонецЦикла;
	Если ХэшДанныхБаннера(Документы) <> ХешДанныхБаннера Тогда
		НайтиИОтобразитьСвязанныеПлатежи();
	КонецЕсли;
	ЗапуститьОбновлениеБаннераСостоянияОтправки();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДокументыОплаты(Форма)
	
	ДокументыОплаты = Новый Массив;
	
	Для Каждого Платеж Из Форма.Платежи Цикл
		ДокументыОплаты.Добавить(Платеж.Ссылка);
	КонецЦикла;
	
	Возврат ДокументыОплаты;
	
КонецФункции

#КонецОбласти

#Область СозданиеИУдалениеДокументовОплаты

&НаСервере
Функция ОплатитьНаСервере(СпособОплаты)
	
	Если СпособОплаты = Перечисления.СпособыУплатыНалогов.БанковскийПеревод Тогда
		
		СчетОрганизации = БанковскийСчетОрганизации(Объект.Организация);
		Если Не ЗначениеЗаполнено(СчетОрганизации) Тогда
			ТекстСообщения = НСтр("ru = 'Укажите банковский счет в реквизитах организации'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Организация);
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СоздатьПлатежныеДокументыНаСервере(СпособОплаты, СчетОрганизации);
	
КонецФункции

&НаСервере
Функция СоздатьПлатежныеДокументыНаСервере(СпособОплаты, СчетОрганизации)
	
	Если ИтогоКОплате(ЭтотОбъект) = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПлатежей = ТаблицаПлатежейДляФормированияПлатежныхПоручений();
	
	Если КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиУСН()
		Или КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиНДФЛПредприниматель() Тогда
		
		НалоговыйПериод = КонецГода(Объект.Период);
	Иначе
		НалоговыйПериод = НачалоГода(Объект.Период);
	КонецЕсли;
	
	СтруктураПараметров = Обработки.ФормированиеПлатежныхПорученийНаУплатуНалогов.НовыеПараметрыФормированияПлатежныхДокументов();
	СтруктураПараметров.Правило         = Правило;
	СтруктураПараметров.ПериодСобытия   = Объект.Период;
	СтруктураПараметров.Организация     = Объект.Организация;
	СтруктураПараметров.НалоговыйПериод = НалоговыйПериод;
	СтруктураПараметров.Платежи         = ПоместитьВоВременноеХранилище(ТаблицаПлатежей);
	СтруктураПараметров.СпособОплаты    = СпособОплаты;
	СтруктураПараметров.СчетОрганизации = СчетОрганизации;
	
	ЗначенияЗаполнения =
		Обработки.ФормированиеПлатежныхПорученийНаУплатуНалогов.ДанныеЗаполненияПлатежныхДокументов(СтруктураПараметров);
	
	Если ЗначениеЗаполнено(ЗначенияЗаполнения) И ЗначенияЗаполнения.Количество() = 1 Тогда
		Возврат ЗначенияЗаполнения[0];
	Иначе
		СозданныеДокументы = 
			Обработки.ФормированиеПлатежныхПорученийНаУплатуНалогов.СоздатьПлатежныеДокументыПоДаннымЗаполнения(
				СтруктураПараметров, ЗначенияЗаполнения);
		
		НайтиИОтобразитьСвязанныеПлатежи();
		
		УстановитьВидимостьКнопокОплаты();
		
		Возврат СозданныеДокументы;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ТаблицаПлатежейДляФормированияПлатежныхПоручений()

	ТаблицаПлатежей = Обработки.ФормированиеПлатежныхПорученийНаУплатуНалогов.НоваяТаблицаПлатежей();
	Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл
		Оплачено = ОплаченоПоВидуНалога(Платежи, СтрокаОстатков.ВидНалога, СтрокаОстатков.ВидПлатежаВБюджет);
		КОплате = Макс(0, СтрокаОстатков.Задолженность - Оплачено);
		Если КОплате = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаПлатежей.Добавить();
		НоваяСтрока.Налог     = СтрокаОстатков.Налог;
		НоваяСтрока.СчетУчета = СтрокаОстатков.СчетУчета;
		НоваяСтрока.Субконто1 = СтрокаОстатков.ВидПлатежаВБюджет;
		НоваяСтрока.Сумма     = КОплате;
	КонецЦикла;
	
	Обработки.ФормированиеПлатежныхПорученийНаУплатуНалогов.ЗаполнитьВидыНалогов(
		ТаблицаПлатежей, Объект.Организация, Объект.Период);
	
	Возврат ТаблицаПлатежей
	
КонецФункции

&НаКлиенте
Функция ОповещениеУдаленияПлатежногоДокумента()
	
	Возврат Новый ОписаниеОповещения("УдалитьДокументУплатыНаКлиентеЗавершение", ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура УдалитьДокументУплатыНаКлиентеЗавершение(ДокументУплатыДляУдаления, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДокументУплатыДляУдаления) Тогда
		УдалитьДокументУплаты(ДокументУплатыДляУдаления);
		ЗапуститьОбновлениеБаннераСостоянияОтправки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументУплаты(ДокументУплатыДляУдаления)
	
	ДокументУплатыОбъект = ДокументУплатыДляУдаления.ПолучитьОбъект();
	ДокументУплатыОбъект.УстановитьПометкуУдаления(Истина);
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	УстановитьВидимостьКнопокОплаты();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеКоманд

&НаКлиенте
Процедура Оплатить(СпособОплаты)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОплаты = ОплатитьНаСервере(СпособОплаты);
	Если РезультатОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатОплаты) = Тип("Структура") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", РезультатОплаты);
		ПараметрыФормы.Вставить("ПериодСобытия", Объект.Период);
		ПараметрыФормы.Вставить("Правило",       Правило);
		
		Если СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.БанковскийПеревод") Тогда
			ИмяФормыУплатыНалога = "Документ.ПлатежноеПоручение.Форма.ФормаДокументаНалоговая";
		Иначе
			ИмяФормыУплатыНалога = "Документ.РасходныйКассовыйОрдер.ФормаОбъекта";
		КонецЕсли;
		ОткрытьФорму(ИмяФормыУплатыНалога, ПараметрыФормы, , УникальныйИдентификатор);
		
	ИначеЕсли РезультатОплаты.Количество() > 0 Тогда
		УправлениеФормой(ЭтотОбъект);
		
		ТипСозданныхДокументов = ТипЗнч(РезультатОплаты[0]);
		ОповеститьОбИзменении(ТипСозданныхДокументов);
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера"));
		Оповестить("ИзменилосьСостояниеДокументаИнтеграцииСБанком", Неопределено, РезультатОплаты);
		ЗапуститьОбновлениеБаннераСостоянияОтправки();
		Оповестить("НалогиПрошлыхПериодов_ИзмененыОстатки",, Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОплаченоНалогаВсего(Форма)
	
	Результат = 0;
	
	Для Каждого СтрокаПлатежа Из Форма.Платежи Цикл
		Результат = Результат + СтрокаПлатежа.Сумма;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОплаченоПоВидуНалога(КоллекцияПлатежей, ВидНалога, ВидПлатежа)
	
	Отбор = Новый Структура("ВидНалога, ВидНалоговогоОбязательства", ВидНалога, ВидПлатежа);
	НайденныеПлатежи = КоллекцияПлатежей.НайтиСтроки(Отбор);
	
	Результат = 0;
	Для Каждого Платеж Из НайденныеПлатежи Цикл
		Результат = Результат + Платеж.Сумма;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроверкаРеквизитовДляОтчетности

&НаСервереБезКонтекста
Функция ПроверитьРеквизитыОрганизации(Организация)
	
	НезаполненныеРеквизиты = Неопределено;
	РеквизитыОрганизацииЗаполнены = ОрганизацииФормыДляОтчетности.РеквизитыЗаполнены(
		Организация, ПроверяемыеРеквизитыОрганизации(Организация), НезаполненныеРеквизиты);
		
	Возврат Новый Структура("РеквизитыЗаполнены, НезаполненныеРеквизиты", РеквизитыОрганизацииЗаполнены, НезаполненныеРеквизиты);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверяемыеРеквизитыОрганизации(Организация)
	
	ЭтоЮрлицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);

	Если ЭтоЮрлицо Тогда
		СтрокаРеквизиты = "НаименованиеСокращенное,НаименованиеПолное,ИНН,КПП,КодПоОКТМО";
	Иначе
		СтрокаРеквизиты = "ИНН,ФамилияИП,ИмяИП,Адрес,КодПоОКТМО";
	КонецЕсли;
	СтрокаРеквизиты = СтрЗаменить(СтрокаРеквизиты, " ", "");
	Возврат СтрРазделить(СтрокаРеквизиты, ",", Ложь);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОпросПомощникаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено
		Или РезультатЗакрытия = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
	КонецЕсли;
	
	ЗавершитьОпросПомощника();
	
КонецПроцедуры

Процедура УстановитьЗаголовок()

	Если КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиУСН() Тогда
		Заголовок = НСтр("ru = 'УСН, оплата за прошлые годы'");
	ИначеЕсли КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиСтраховыеВзносыИП() Тогда
		Заголовок = НСтр("ru = 'Взносы за себя, оплата за прошлые годы'");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресСведенийОбОрганизации(Организация, УникальныйИдентификатор)

	СведенияОбОрганизации = Обработки.РасчетСтраховыхВзносовИП.СведенияОбОрганизации(
		Организация, ОбщегоНазначения.ТекущаяДатаПользователя());
	Возврат ПоместитьВоВременноеХранилище(СведенияОбОрганизации, УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыСуммНалога()
	
	Налог = 0;
	Пеня  = 0;
	Штраф = 0;
	Итого = 0;
	
	Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл
		Если СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
			Налог = СтрокаОстатков.Задолженность;
		ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
			Пеня = СтрокаОстатков.Задолженность;
		ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Штраф Тогда
			Штраф = СтрокаОстатков.Задолженность;
		КонецЕсли;
		Итого = Итого + СтрокаОстатков.Задолженность;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСуммВзносов()
	
	ПФРВзнос             = 0;
	ПФРПеня              = 0;
	ПФРШтраф             = 0;
	ПФРВзносСвышеПредела = 0;
	ПФРИтого             = 0;
	
	ФФОМСВзнос = 0;
	ФФОМСПеня  = 0;
	ФФОМСШтраф = 0;
	ФФОМСИтого = 0;
	
	ЕдиныйТарифВзнос = 0;
	ЕдиныйТарифПеня = 0;
	ЕдиныйТарифШтраф = 0;
	ЕдиныйТарифИтого = 0;
	
	Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл
		Если СтрокаОстатков.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф Тогда
			Если СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
				ЕдиныйТарифВзнос = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
				ЕдиныйТарифПеня = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Штраф Тогда
				ЕдиныйТарифШтраф = СтрокаОстатков.Задолженность;
			КонецЕсли;
			ЕдиныйТарифИтого = ЕдиныйТарифИтого + СтрокаОстатков.Задолженность;
		ИначеЕсли СтрокаОстатков.ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть Тогда
			Если СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
				ПФРВзнос = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
				ПФРПеня = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Штраф Тогда
				ПФРШтраф = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.ВзносыСвышеПредела Тогда
				ПФРВзносСвышеПредела = СтрокаОстатков.Задолженность;
			КонецЕсли;
			ПФРИтого = ПФРИтого + СтрокаОстатков.Задолженность;
		Иначе
			Если СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
				ФФОМСВзнос = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
				ФФОМСПеня = СтрокаОстатков.Задолженность;
			ИначеЕсли СтрокаОстатков.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Штраф Тогда
				ФФОМСШтраф = СтрокаОстатков.Задолженность;
			КонецЕсли;
			ФФОМСИтого = ФФОМСИтого + СтрокаОстатков.Задолженность;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыПлатежей(ЭтоЗадачаВзносовИП)
	
	Результат = Обработки.ПомощникУплатыНалоговВзносовПрошлыхЛет.ПоддерживаемыеВидыНалоговыхОбязательств();
	Если ЭтоЗадачаВзносовИП Тогда
		Результат.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ВзносыСвышеПредела);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЗадачаВзносовИП(КодЗадачи)
	
	Возврат КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиСтраховыеВзносыИП();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОперацииПоЕНС()
	
	Если Не ПлательщикЕНП Тогда
		Возврат;
	КонецЕсли;
	
	ОперацииПоЕНС.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыОперацийПереходаНаЕНС.ДокументОперации КАК ДокументОперации
	|ПОМЕСТИТЬ ДокументыЕНС
	|ИЗ
	|	РегистрСведений.ДокументыОперацийПереходаНаЕНС КАК ДокументыОперацийПереходаНаЕНС
	|ГДЕ
	|	ДокументыОперацийПереходаНаЕНС.Организация = &Организация
	|	И ДокументыОперацийПереходаНаЕНС.ДатаПерехода = &ДатаПерехода
	|	И ДокументыОперацийПереходаНаЕНС.ВидОперации В(&ВидыОпераций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОперацияПоЕдиномуНалоговомуСчетуНалоги.Ссылка КАК Ссылка
	|ИЗ
	|	ДокументыЕНС КАК ДокументыЕНС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияПоЕдиномуНалоговомуСчету.Налоги КАК ОперацияПоЕдиномуНалоговомуСчетуНалоги
	|		ПО ДокументыЕНС.ДокументОперации = ОперацияПоЕдиномуНалоговомуСчетуНалоги.Ссылка
	|ГДЕ
	|	ОперацияПоЕдиномуНалоговомуСчетуНалоги.СчетУчета В(&СчетаУчета)
	|	И ОперацияПоЕдиномуНалоговомуСчетуНалоги.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОперацияПоЕдиномуНалоговомуСчетуСанкции.Ссылка
	|ИЗ
	|	ДокументыЕНС КАК ДокументыЕНС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияПоЕдиномуНалоговомуСчету.Санкции КАК ОперацияПоЕдиномуНалоговомуСчетуСанкции
	|		ПО ДокументыЕНС.ДокументОперации = ОперацияПоЕдиномуНалоговомуСчетуСанкции.Ссылка
	|ГДЕ
	|	ОперацияПоЕдиномуНалоговомуСчетуСанкции.СчетЗатрат В(&СчетаУчета)
	|	И ОперацияПоЕдиномуНалоговомуСчетуСанкции.Ссылка.Проведен";

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаПерехода", ДатаПереходаНаЕНС);
	
	ВидыОперацийЕНС = Новый Массив;
	ВидыОперацийЕНС.Добавить(Перечисления.ВидыОперацийПоЕдиномуНалоговомуСчету.НачислениеНалогов);
	ВидыОперацийЕНС.Добавить(Перечисления.ВидыОперацийПоЕдиномуНалоговомуСчету.НачислениеПенейШтрафов);
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОперацийЕНС);
	
	СчетаУчета = ТаблицаОстатков.Выгрузить().ВыгрузитьКолонку("СчетУчета");
	Запрос.УстановитьПараметр("СчетаУчета", СчетаУчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОписаниеДокумента = Документы.ОперацияПоЕдиномуНалоговомуСчету.ОписаниеДокумента(Выборка.Ссылка);
		
		СтрокаОперации = ОперацииПоЕНС.Добавить();
		СтрокаОперации.Ссылка = Выборка.Ссылка;
		СтрокаОперации.ПредставлениеДокумента = ОписаниеДокумента.Наименование;
	КонецЦикла;
	
	ПомощникиПоУплатеНалоговИВзносов.ОтобразитьДокументы(
		ЭтотОбъект, ОперацииПоЕНС, "ОперацияЕНС");
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьОпросПомощника()
	
	ЗаполнитьЗадолженность();
	ЗаполнитьОперацииПоЕНС();
	УстановитьВидимостьКнопокОплаты();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПлатежныеДокументыЗавершение(ПлатежныеПоручения, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ПлатежныеПоручения) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыгрузкуПлатежейНаСервере(ПлатежныеПоручения);
	
	ЗапуститьОбновлениеБаннераСостоянияОтправки();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыгрузкуПлатежейНаСервере(ПлатежныеПоручения)
	
	Для Каждого ПлатежныйДокумент Из ПлатежныеПоручения Цикл
		РегистрыСведений.СостоянияБанковскихДокументов.УстановитьСостояниеДокумента(
			ПлатежныйДокумент, Перечисления.СостоянияБанковскихДокументов.Отправлено);
	КонецЦикла;
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	УстановитьВидимостьКнопокОплаты();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НеИсполненныеПлатежи(Форма)
	
	ДокументыОплаты = Новый Массив;
	
	Для Каждого СтрокаОплаты Из Форма.Платежи Цикл
		Если ТипЗнч(СтрокаОплаты.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручение")
			И Не ПомощникиПоУплатеНалоговИВзносовКлиентСервер.СостояниеОплачено(СтрокаОплаты.Состояние)
			И Не ПомощникиПоУплатеНалоговИВзносовКлиентСервер.СостояниеОшибки(СтрокаОплаты.Состояние) Тогда
			ДокументыОплаты.Добавить(СтрокаОплаты.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДокументыОплаты;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НеОтправленныеПлатежи(Форма)
	
	ДокументыОплаты = Новый Массив;
	
	Для Каждого СтрокаОплаты Из Форма.Платежи Цикл
		Если ТипЗнч(СтрокаОплаты.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручение")
			И Не ПомощникиПоУплатеНалоговИВзносовКлиентСервер.СостояниеУспешнойОтправки(СтрокаОплаты.Состояние)
			И Не ПомощникиПоУплатеНалоговИВзносовКлиентСервер.СостояниеОшибки(СтрокаОплаты.Состояние)
			И Не ПомощникиПоУплатеНалоговИВзносовКлиентСервер.СостояниеОплачено(СтрокаОплаты.Состояние) Тогда
			ДокументыОплаты.Добавить(СтрокаОплаты.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДокументыОплаты;
	
КонецФункции

&НаСервере
Функция ТребуетсяВыгрузитьДокументыОплаты()
	
	ДокументыОплатыВФайл = ПлатежныеДокументыДляВыгрузкиВФайл();
	
	Возврат ЗначениеЗаполнено(ДокументыОплатыВФайл);
	
КонецФункции

&НаСервере
Функция ТребуетсяОтправитьДокументыОплатыПоДиректБанку()
	
	ДокументыОплатыПоБанку = ПлатежныеДокументыДляОтправкиПоДиректБанку();
	
	Возврат ЗначениеЗаполнено(ДокументыОплатыПоБанку);
	
КонецФункции

&НаСервере
Функция ПлатежныеДокументыДляВыгрузкиВФайл()
	
	НеИсполненныеПлатежи = НеИсполненныеПлатежи(ЭтотОбъект);
	
	Возврат ПомощникиПоУплатеНалоговИВзносов.ПлатежныеДокументыДляВыгрузкиВФайл(
		Объект.Организация, НеИсполненныеПлатежи);
	
КонецФункции

&НаСервере
Функция ПлатежныеДокументыДляОтправкиПоДиректБанку()
	
	НеОтправленныеПлатежи = НеОтправленныеПлатежи(ЭтотОбъект);
	
	Возврат ПомощникиПоУплатеНалоговИВзносов.ПлатежныеДокументыПоДиректБанку(
		Объект.Организация, НеОтправленныеПлатежи);
	
КонецФункции

#КонецОбласти
